In [1]:
import pandas as pd
import numpy as np

0 = Down payment            as DP<br/>
1 = Down payment + EMI      as DP + EMI<br/>
2 = EMI                     as EMI

In [211]:
def find_y(df):
    Ms = df['Monthly savings']
    Ts = df['Total savings']
    price = df['Price']
    essential = df['Essentail']
    
    if essential==1:
        if Ts>price:
            return 0
        elif Ts<=price:
            if Ms+Ts>price:
                return 0
            elif price-Ts<=Ms*.5:
                return 1
            elif price-Ts<=Ms*.3:
                return 1
            else:
                return 2
            
    elif essential==0:
        if Ts>price:
            return 0
        elif Ms+Ts>price:
                return 0
        elif Ts<=price:
            return 2

In [64]:
np.random.seed(1024)

In [139]:
#income
income = np.random.randint(100,1000000,500000)

In [140]:
#Monthly savings income's 20% 
Ms = np.random.randint(100,200000,500000)

In [141]:
#Total savings Monthly savings's 5x 
Ts = np.random.randint(100,1000000,500000)

In [142]:
ess = np.random.randint(0,2,500000)

In [143]:
# Price
price = np.random.randint(0,2,500000)

In [151]:
df = pd.DataFrame({
    "income":income,
    "Monthly savings":Ms,
    "Total savings":Ts,
    "Essentail":ess,
    "Price":price
})

In [157]:
df.loc[0]

income             390648
Monthly savings    148996
Total savings      906346
Essentail               0
Price                   1
Name: 0, dtype: int32

In [198]:
print(df.loc[0])

income             390648
Monthly savings    148996
Total savings      906346
Essentail               0
Price                   1
Output                  0
Name: 0, dtype: int64

In [212]:
df['Output'] = df.apply(find_y,axis=1)

In [225]:
df['Output'].value_counts()

Output
0    500000
Name: count, dtype: int64

In [2]:
df = pd.read_csv("./data/data.csv")

In [3]:
df.head()

,Unnamed: 0,income,Total savings,Price,Monthly savings,Output,Essentail
0,0,399700,70300,1300,66600,0,0
1,1,232700,191900,82300,33200,1,0
2,2,936800,552600,8700,187400,0,0
3,3,793000,339500,64700,113300,1,0
4,4,1529700,326000,53300,191200,1,0

In [6]:
df.drop(columns=['Unnamed: 0'],inplace=True)

In [7]:
25/3

8.333333333333334

In [35]:
df_0 = df[df['Output']==0].sample(int(df[df['Output']==0].shape[0]/4))

In [26]:
df[df['Output']==1].shape[0]

238256

In [36]:
df_1 = df[df['Output']==1].sample(int(df[df['Output']==1].shape[0]/4))

In [27]:
df[df['Output']==2].shape[0]

123608

In [37]:
df_2 = df[df['Output']==2].sample(int(df[df['Output']==2].shape[0]/4))

0 to 1 | 1 to 2 | 2 to 0

In [40]:
df_0['Output']=1
df_1['Output']=2
df_2['Output']=0

In [41]:
df = pd.concat([df,df_0,df_1,df_2])

In [43]:
df

         income  Total savings  Price  Monthly savings  Output  Essentail
0        399700          70300   1300            66600       0          0
1        232700         191900  82300            33200       1          0
2        936800         552600   8700           187400       0          0
3        793000         339500  64700           113300       1          0
4       1529700         326000  53300           191200       1          0
...         ...            ...    ...              ...     ...        ...
560241    73500          66600  38800             9500       0          0
523713  1180700          54400  38700           167700       0          0
96556     78900          59600  36900            15800       0          0
357382   626200          29300  27800            89400       0          0
529734    22200          59900  48900             3500       0          0

[702255 rows x 6 columns]

In [42]:
df.to_csv("./data/data.csv")